// ДЗ 36. Працюємо з бібліотеками bootstrap, moment

// Bootstrap:

// - Вивести на сторінку кнопку (застосувати стилі бутстрапа) при натисканні на яку відкривається модальне вікно
//  з деякими даними

// - Повісити на цю кнопку Tooltip із довільним текстом

// - Створити ще одну кнопку, при натисканні на яку показується бутстрапівський алерт. При повторному натисканні -
//  ховається.

// Moment:

// - Вивести дату вашого народження в довільному форматі з використанням moment.js

// - Отримати від користувача дату його народження в певному форматі і через moment.js перетворити в інший формат
