// ДЗ 9. Додаткова практика з циклами

// Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)

let str = "";

for (let i = 20; i <= 30; i += 0.5) {
  str += i + " ";
}
console.log(
  `Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 \n ${str}`
);
// Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів

let dollars = "";
let rate = 40;

for (let i = 10; i <= 100; i += 10) {
  dollars = i * rate;
  console.log(`${i} доларів коштує ${dollars} грн`);
}

// Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N

let n = 1000;
let pow = "";
let powLess = "";

for (i = 1; i <= 100; i += 1) {
  pow = i ** 2;

  if (pow < n) {
    powLess += i + ", ";
  }
}
console.log(
  `Дано ціле число ${n}. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа ${n}: \n ${powLess}`
);

// Дано ціле число. З'ясувати, чи є воно простим
//  (простим називається число, більше ніж 1, які не мають інших дільників крім 1 і себе).

let number = 3;
let isPrime = number > 1;

if (number < 2) {
  isPrime = false;
} else {
  for (let i = 2; i <= Math.sqrt(number); i += 1) {
    if (number % i === 0) {
      isPrime = false;
      break;
    }
  }
}

console.log(
  isPrime ? `Число ${number} є простим ` : `Число ${number} НЕ є простим`
);

// Дано деяке число. Ваше завдання – визначити, чи можна отримати це число, піднявши число 3 до певного
// натурального ступеня. (Як приклад, числа 9 та 81 можна отримати цим способом, але 13 – ні.)

let num = 27;
let power = 1;
let isPowerOfThree = false;

while (power <= num) {
  if (power === num) {
    isPowerOfThree = true;
    break;
  }
  power *= 3;
}

console.log(
  isPowerOfThree ? `Число ${num} є степенем 3` : `Число ${num} не є степенем 3`
);
